In [ ]:
!pip install pandasql

Requirement already satisfied: pandasql in /usr/local/lib/python3.6/dist-packages (0.7.3)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.0.5)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.19)
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.15.0)

In [ ]:
import pandas as pd
import pandasql

In [ ]:
ovnis = pd.read_csv("OVNIS.csv")

In [ ]:
ovnis.head(5)

     Date / Time  ...   Posted
0  1/29/97 23:15  ...   3/7/98
1  1/26/97 22:00  ...  3/19/09
2  1/25/97 21:00  ...   3/7/98
3  1/25/97 06:00  ...  4/28/01
4  1/24/97 19:00  ...   3/7/98

[5 rows x 7 columns]

In [ ]:
# 5.4     Item 1 Saber a quantidade de linhas, observações ou variáveis que foram coletadas.

len(ovnis)

102391

In [ ]:
# Item 2 Quantos relatos ocorreram por estado em ordem decrescente?

estado_desc = ovnis["State"].value_counts() # contando os relatos pela coluna state 
estado_desc.sort_values(ascending=False)

CA    11745
FL     5721
WA     4992
TX     4230
NY     3952
      ...
PE       20
PR       19
YT       19
YK        5
VI        1
Name: State, Length: 68, dtype: int64

In [ ]:
#Item 3 Remover possíveis campos vazios (sem estado).
ovnis["State"].dropna()

0         RI
1         AZ
2         WI
3         ON
4         UT
          ..
102385    NY
102386    OK
102387    VA
102388    ID
102390    AK
Name: State, Length: 95084, dtype: object

In [ ]:
#Item 4
q = """
   SELECT * from ovnis where State LIKE '%AK%' OR State LIKE '%AL%'
OR State LIKE '%AR%'
OR State LIKE '%AZ%'
OR State LIKE '%CA%'
OR State LIKE '%CO%'
OR State LIKE '%CT%'
OR State LIKE '%DE%'
OR State LIKE '%FL%'
OR State LIKE '%GA%'
OR State LIKE '%HI%'
OR State LIKE '%IA%'
OR State LIKE '%ID%'
OR State LIKE '%IL%'
OR State LIKE '%IN%'
OR State LIKE '%KS%'
OR State LIKE '%KY%'
OR State LIKE '%LA%'
OR State LIKE '%MA%'
OR State LIKE '%MD%'
OR State LIKE '%ME%'
OR State LIKE '%MI%'
OR State LIKE '%MN%' OR State LIKE '%MO%' OR State LIKE '%MS%' OR State LIKE '%MT%' OR State LIKE '%NC%' OR State LIKE '%ND%' 
OR State LIKE '%NE%' 
OR State LIKE '%NH%' 
OR State LIKE '%NJ%' 
OR State LIKE '%NM%' 
OR State LIKE '%NV%' 
OR State LIKE '%NY%' 
OR State LIKE '%OH%' 
OR State LIKE '%OK%' 
OR State LIKE '%OR%' 
OR State LIKE '%PA%' 
OR State LIKE '%RI%' 
OR State LIKE '%SC%' 
OR State LIKE '%SD%' 
OR State LIKE '%TN%' 
OR State LIKE '%TX%' 
OR State LIKE '%UT%' 
OR State LIKE '%VA%' 
OR State LIKE '%VT%' 
OR State LIKE '%WA%' 
OR State LIKE '%WI%' 
OR State LIKE '%WV%' 
OR State LIKE '%WY%'
  """
estados_unidos = pandasql.sqldf(q.lower(), locals())
estados_unidos

         Date / Time  ...    Posted
0      1/29/97 23:15  ...    3/7/98
1      1/26/97 22:00  ...   3/19/09
2      1/25/97 21:00  ...    3/7/98
3      1/24/97 19:00  ...    3/7/98
4      1/23/97 18:30  ...   1/27/05
...              ...  ...       ...
90587  12/1/17 17:00  ...   12/4/17
90588  12/1/17 17:00  ...  12/10/17
90589  12/1/17 04:00  ...   12/4/17
90590  12/1/17 04:00  ...   12/4/17
90591  12/1/17 01:00  ...   12/4/17

[90592 rows x 7 columns]

In [ ]:
# tem 5 Consulta por cidades, com o objetivo de saber quais contêm o maior número de relatos (cidades que apresentem ao menos 10 relatos).

#cidade_estados_unidos = estados_unidos["City"].value_counts()
#cidade_estados_unidos[cidade_estados_unidos>=10]
   
q = """
    SELECT City,count(city) as 'número relatos' from ovnis Group by city having count(city) >=10 order by count(city)desc

    """
cidade_estados_unidos = pandasql.sqldf(q.lower(),locals())
cidade_estados_unidos

In [ ]:
#Com o dado anterior, responder a seguinte pergunta: por que será que essa é a cidade que possui mais relatos?
# A cidade de Phoenix resgistrou o maior número de relatos em relação as outras cidades, pois constatou um alto número de testemunha 
# que avistaram diversoso objteos no céu dos EUA ao mesmo tempo, esse fenômeno ficou conhecida na midia social como luzes de phoenix.

In [ ]:
#Fazer uma query exclusiva para o estado com maior número de relatos, buscando cidades que possuam um número superior a 10 relatórios. 
#Enfatizar a cidade, a quantidade de relatos e formato do objeto não identificado.
 
q = """
    SELECT State,city,shape, count(state) as 'número relatos' from estados_unidos Group by state having count(state) >10 order by count(state)desc
 
    """
 
 
estado_estados_unidos = pandasql.sqldf(q.lower(),locals())
estado_estados_unidos